## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/c3abeefc-8467-408f-9c42-cbb09ca24a47/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.wonderdoof-cluster will be created
  + resource "azurerm_kubernetes_cluster" "wonderdoof-cluster" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "wonderfood-cluster"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "brazilsouth"
      + name                                = "wonderfood-cluster"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "wonderfood-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = false

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 3
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
          + zones                = [
              + "2",
            ]
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_mysql_flexible_server.wonderfood-mysql-server will be created
  + resource "azurerm_mysql_flexible_server" "wonderfood-mysql-server" {
      + administrator_login           = "ffadminuser"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "brazilsouth"
      + name                          = "wonderfood-mysql-server"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "wonderfood-rg"
      + sku_name                      = "GP_Standard_D2ds_v4"
      + version                       = "8.0.21"
    }

  # azurerm_private_dns_zone.wonderfood-privatedns will be created
  + resource "azurerm_private_dns_zone" "wonderfood-privatedns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "wonderfood-dns.mysql.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "wonderfood-rg"
    }

  # azurerm_private_dns_zone_virtual_network_link.wonderfood-privatedns-link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "wonderfood-privatedns-link" {
      + id                    = (known after apply)
      + name                  = "wonderfood.com"
      + private_dns_zone_name = "wonderfood-dns.mysql.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "wonderfood-rg"
      + virtual_network_id    = (known after apply)
    }

  # azurerm_resource_group.wonderfood-rg will be created
  + resource "azurerm_resource_group" "wonderfood-rg" {
      + id       = (known after apply)
      + location = "brazilsouth"
      + name     = "wonderfood-rg"
    }

  # azurerm_role_assignment.github-actions-aks-role will be created
  + resource "azurerm_role_assignment" "github-actions-aks-role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4318c106-e000-489f-96b1-76af44cfff9c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_subnet.wonderfood-aks-subnet will be created
  + resource "azurerm_subnet" "wonderfood-aks-subnet" {
      + address_prefixes                               = [
          + "10.25.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "wonderfood-aks-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "wonderfood-rg"
      + virtual_network_name                           = "wonderfood-vnet"
    }

  # azurerm_subnet.wonderfood-mysql-subnet will be created
  + resource "azurerm_subnet" "wonderfood-mysql-subnet" {
      + address_prefixes                               = [
          + "10.25.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "wonderfood-mysql-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "wonderfood-rg"
      + virtual_network_name                           = "wonderfood-vnet"

      + delegation {
          + name = "Microsoft.DBforMySQL/flexibleServers"

          + service_delegation {
              + name = "Microsoft.DBforMySQL/flexibleServers"
            }
        }
    }

  # azurerm_virtual_network.wonderfood-vnet will be created
  + resource "azurerm_virtual_network" "wonderfood-vnet" {
      + address_space       = [
          + "10.25.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "brazilsouth"
      + name                = "wonderfood-vnet"
      + resource_group_name = "wonderfood-rg"
      + subnet              = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_kubernetes_cluster.wonderdoof-cluster will be created%0A  + resource "azurerm_kubernetes_cluster" "wonderdoof-cluster" {%0A      + api_server_authorized_ip_ranges     = (known after apply)%0A      + dns_prefix                          = "wonderfood-cluster"%0A      + fqdn                                = (known after apply)%0A      + http_application_routing_zone_name  = (known after apply)%0A      + id                                  = (known after apply)%0A      + image_cleaner_enabled               = false%0A      + image_cleaner_interval_hours        = 48%0A      + kube_admin_config                   = (sensitive value)%0A      + kube_admin_config_raw               = (sensitive value)%0A      + kube_config                         = (sensitive value)%0A      + kube_config_raw                     = (sensitive value)%0A      + kubernetes_version                  = (known after apply)%0A      + location                            = "brazilsouth"%0A      + name                                = "wonderfood-cluster"%0A      + node_resource_group                 = (known after apply)%0A      + node_resource_group_id              = (known after apply)%0A      + oidc_issuer_url                     = (known after apply)%0A      + portal_fqdn                         = (known after apply)%0A      + private_cluster_enabled             = false%0A      + private_cluster_public_fqdn_enabled = false%0A      + private_dns_zone_id                 = (known after apply)%0A      + private_fqdn                        = (known after apply)%0A      + public_network_access_enabled       = true%0A      + resource_group_name                 = "wonderfood-rg"%0A      + role_based_access_control_enabled   = true%0A      + run_command_enabled                 = true%0A      + sku_tier                            = "Free"%0A      + support_plan                        = "KubernetesOfficial"%0A      + workload_identity_enabled           = false%0A%0A      + default_node_pool {%0A          + enable_auto_scaling  = true%0A          + kubelet_disk_type    = (known after apply)%0A          + max_count            = 3%0A          + max_pods             = (known after apply)%0A          + min_count            = 1%0A          + name                 = "default"%0A          + node_count           = 1%0A          + node_labels          = (known after apply)%0A          + orchestrator_version = (known after apply)%0A          + os_disk_size_gb      = (known after apply)%0A          + os_disk_type         = "Managed"%0A          + os_sku               = (known after apply)%0A          + scale_down_mode      = "Delete"%0A          + type                 = "VirtualMachineScaleSets"%0A          + ultra_ssd_enabled    = false%0A          + vm_size              = "Standard_B2s"%0A          + vnet_subnet_id       = (known after apply)%0A          + workload_runtime     = (known after apply)%0A          + zones                = [%0A              + "2",%0A            ]%0A        }%0A%0A      + identity {%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "SystemAssigned"%0A        }%0A    }%0A%0A  # azurerm_mysql_flexible_server.wonderfood-mysql-server will be created%0A  + resource "azurerm_mysql_flexible_server" "wonderfood-mysql-server" {%0A      + administrator_login           = "ffadminuser"%0A      + administrator_password        = (sensitive value)%0A      + backup_retention_days         = 7%0A      + delegated_subnet_id           = (known after apply)%0A      + fqdn                          = (known after apply)%0A      + geo_redundant_backup_enabled  = false%0A      + id                            = (known after apply)%0A      + location                      = "brazilsouth"%0A      + name                          = "wonderfood-mysql-server"%0A      + private_dns_zone_id           = (known after apply)%0A      + public_network_access_enabled = (known after apply)%0A      + replica_capacity              = (known after apply)%0A      + replication_role              = (known after apply)%0A      + resource_group_name           = "wonderfood-rg"%0A      + sku_name                      = "GP_Standard_D2ds_v4"%0A      + version                       = "8.0.21"%0A    }%0A%0A  # azurerm_private_dns_zone.wonderfood-privatedns will be created%0A  + resource "azurerm_private_dns_zone" "wonderfood-privatedns" {%0A      + id                                                    = (known after apply)%0A      + max_number_of_record_sets                             = (known after apply)%0A      + max_number_of_virtual_network_links                   = (known after apply)%0A      + max_number_of_virtual_network_links_with_registration = (known after apply)%0A      + name                                                  = "wonderfood-dns.mysql.database.azure.com"%0A      + number_of_record_sets                                 = (known after apply)%0A      + resource_group_name                                   = "wonderfood-rg"%0A    }%0A%0A  # azurerm_private_dns_zone_virtual_network_link.wonderfood-privatedns-link will be created%0A  + resource "azurerm_private_dns_zone_virtual_network_link" "wonderfood-privatedns-link" {%0A      + id                    = (known after apply)%0A      + name                  = "wonderfood.com"%0A      + private_dns_zone_name = "wonderfood-dns.mysql.database.azure.com"%0A      + registration_enabled  = false%0A      + resource_group_name   = "wonderfood-rg"%0A      + virtual_network_id    = (known after apply)%0A    }%0A%0A  # azurerm_resource_group.wonderfood-rg will be created%0A  + resource "azurerm_resource_group" "wonderfood-rg" {%0A      + id       = (known after apply)%0A      + location = "brazilsouth"%0A      + name     = "wonderfood-rg"%0A    }%0A%0A  # azurerm_role_assignment.github-actions-aks-role will be created%0A  + resource "azurerm_role_assignment" "github-actions-aks-role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = "4318c106-e000-489f-96b1-76af44cfff9c"%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # azurerm_subnet.wonderfood-aks-subnet will be created%0A  + resource "azurerm_subnet" "wonderfood-aks-subnet" {%0A      + address_prefixes                               = [%0A          + "10.25.2.0/24",%0A        ]%0A      + enforce_private_link_endpoint_network_policies = (known after apply)%0A      + enforce_private_link_service_network_policies  = (known after apply)%0A      + id                                             = (known after apply)%0A      + name                                           = "wonderfood-aks-subnet"%0A      + private_endpoint_network_policies_enabled      = (known after apply)%0A      + private_link_service_network_policies_enabled  = (known after apply)%0A      + resource_group_name                            = "wonderfood-rg"%0A      + virtual_network_name                           = "wonderfood-vnet"%0A    }%0A%0A  # azurerm_subnet.wonderfood-mysql-subnet will be created%0A  + resource "azurerm_subnet" "wonderfood-mysql-subnet" {%0A      + address_prefixes                               = [%0A          + "10.25.1.0/24",%0A        ]%0A      + enforce_private_link_endpoint_network_policies = (known after apply)%0A      + enforce_private_link_service_network_policies  = (known after apply)%0A      + id                                             = (known after apply)%0A      + name                                           = "wonderfood-mysql-subnet"%0A      + private_endpoint_network_policies_enabled      = (known after apply)%0A      + private_link_service_network_policies_enabled  = (known after apply)%0A      + resource_group_name                            = "wonderfood-rg"%0A      + virtual_network_name                           = "wonderfood-vnet"%0A%0A      + delegation {%0A          + name = "Microsoft.DBforMySQL/flexibleServers"%0A%0A          + service_delegation {%0A              + name = "Microsoft.DBforMySQL/flexibleServers"%0A            }%0A        }%0A    }%0A%0A  # azurerm_virtual_network.wonderfood-vnet will be created%0A  + resource "azurerm_virtual_network" "wonderfood-vnet" {%0A      + address_space       = [%0A          + "10.25.0.0/16",%0A        ]%0A      + dns_servers         = (known after apply)%0A      + guid                = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "brazilsouth"%0A      + name                = "wonderfood-vnet"%0A      + resource_group_name = "wonderfood-rg"%0A      + subnet              = (known after apply)%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>